src/QLDiemComApp/test/TestCapNhatHocBa/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:qld="QLDiemComApp">
  <soapenv:Body>
    <qld:CapNhatHocBaOperation>
      <hocky>1</hocky>
      <namhoc>1</namhoc>
      <id_hocsinh>1</id_hocsinh>
      <id_lop>1</id_lop>
      <diemtrungbinh>9</diemtrungbinh>
      <id_hocba>1</id_hocba>
    </qld:CapNhatHocBaOperation>
  </soapenv:Body>
</soapenv:Envelope>